import 'package:flutter/material.dart';

import '../../Utils/Constants/app_size.dart';

class FamilyTermsAndConditionsPage extends StatelessWidget {
  const FamilyTermsAndConditionsPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('شروط وأحكام الأسر المنتجة'),
        centerTitle: true,
      ),
      body: Padding(
        padding: const EdgeInsets.all(16.0),
        child: ListView(
          children: [
            Text(
              'مرحبًا بكم في تطبيق "مأكول"',
              textAlign: TextAlign.center,
              style: TextStyle(
                fontWeight: FontWeight.bold,
                fontSize: AppSize.widthSize(20, context),
              ),
            ),
            SizedBox(height: AppSize.heightSize(10, context)),
            _buildParagraph('تاريخ السريان: فبراير 2024'),
            SizedBox(height: AppSize.heightSize(10, context)),

            _buildSectionTitle('[1]	المقدمة'),
            _buildBulletPoint(
                '1.1.	تقدم مؤسسة نجلاء علي الدبيان باعتبارها المالك والمشغّل لتطبيق "مأكول" والذي يعمل كمنصة وسيطة عبر الإنترنت بين الأسر المنتجة التي تعرض وتبيع الأكلات والوجبات الصحية وربطهم بالعملاء الذين يطلبون أو يشترون هذه المنتجات في نطاقهم الجغرافي، ويقتصر دور التطبيق على الوساطة والربط بين الأسر المنتجة والعملاء.'),
            _buildBulletPoint(
                '1.2.	تحكُم هذه الشّروط والأحكام إلى جانب سياسة الخصوصيّة القواعد التي تحكم وصول الأسر المنتجة إلى تطبيق "مأكول"، ومن المهم قراءتها وفهمها جيدًا لأنها تُحدِّد كافة الإرشاداتِ اللازمةِ لطريقة استخدام خدماتها.'),
            _buildBulletPoint(
                '1.3.	بوصولك كأسرة منتجة إلى تطبيق "مأكول" وإكمال تسجيلك حساب واستخدام التطبيق في عرض وبيع الوجبات والأكلات من خلاله، فأنتَ تؤكّد لنا بأنّك قرأت وفهمت ووافقت على هذه الشّروط، إذا كنت لا توافق على هذه الشّروط، فالرجاء عدم استخدام خدمات التطبيق.'),
            _buildBulletPoint(
                '1.4.	يحق لنا -وفقًا لتقديرنا الخاص- إجراء تعديلات على كل/أو أجزاء من هذه الشّروط في أيّ وقت، ويكون للتعديلات الجديدة نفس الأحكام والآثار القانونية للنسخة الحالية من هذه الشّروط. لذا ننصحك بمراجعة هذه الشّروط بانتظام للاطّلاع على أيّ تعديلات عليها، وستُصبح التعديلات سارية تلقائيًا بمجرد نشرها على هذه الصفحة.'),
            //======== التعريفيات
            _buildSectionTitle('[2]	التعريفات'),
            _buildParagraph(
                'يكون للكلمات التالية المعنى الموضّح قرين كل منها ما لم يقتضِ السياق خلاف ذلك:'),
            _buildBulletPoint(
                '2.1.	"التطبيق": يُقصد به تطبيق "مأكول" لأنظمة Android و iOS.'),
            _buildBulletPoint(
                '2.2.	"نحن" أو "ضمير المتكلم" أو "ضمير الملكية": يُقصد بها مؤسسة نجلاء علي الدبيان.'),
            _buildBulletPoint(
                '2.3.	"الأسر المنتجة": يُقصد به كل من يُسجّل حساب في تطبيق "مأكول" بغرض عرض وبيع المنتجات.'),
            _buildBulletPoint(
                '2.4.	"العميل": يُقصد به كل من يُسجّل حساب في تطبيق "مأكول" بغرض طلب وشراء المنتجات التي تعرضها الأسر المنتجة المُسجّلة في التطبيق، ويشار له بلفظ الجمع: "العملاء".'),
            _buildBulletPoint(
                '2.5.	"المنتجات": يُقصد بها الاكلات و الوجبات الصحية التي تعرضها الأسر المنتجة على تطبيق "مأكول".'),
            _buildBulletPoint(
                '2.6.	"الطلب": يُقصد به الطلب الذي يقدمه العميل إلى الأسر المنتجة لشراء أحد المنتجات المعروضة في التطبيق.'),
            _buildBulletPoint(
                '2.7.	"المحتوى": يُقصد به مُحتوى تطبيق "مأكول" ويشمل ذلك المعلومات، والبيانات، والنصوص، والصور، ومقاطع الفيديو، والصوت، والرسومات، والميزات التفاعليّة التي يتم توفيرها أو إتاحتها للمُستخدِم.'),
            _buildBulletPoint(
                '2.8.	"حقوق الملكيّة الفكريّة": يُقصد بها كافة الحقوق المتعلقة بتطبيق "مأكول"، والتي تشمل على سبيل المثال لا الحصر الحقوق والأعمال البرمجيّة، حقوق المؤلّف، حقوق الطبع والنشر، براءة الاختراع، العلامات التّجارية -سواء مسجّلة أو غير مسجّلة-، اسم النطاق (بأيّ امتداد)، الشعارات، التصاميم، الرسومات، الاسم التّجاريّ، الرخصة التّجاريّة، وغيرها من الحقوق المقررة أو المرتبطة بالتطبيق سواء كان مسجّلة أو غير مسجّلة.'),
            _buildBulletPoint(
                '2.9.	"القوة القاهرة": يُقصد بها أيّ حدث سواء كان مباشر أو غير مباشر أو ظرف خارج عن سيطرة الطرف الذي تأثر به، ويمنعه من تنفيذ أيّ أو جميع التزاماته التي تتجاوز السيطرة المعقولة.'),
            _buildBulletPoint(
                '2.10.	"الأطراف الثالثة": يُقصد بها كافة الأشخاص والجهات الأخرى غير التابعة لنا والتي قد تشاركنا في تقديم الخدمات أو التي قد توفّر خدماتها من خلال تطبيق "مأكول"، أو التي قد تساهم في نشر أو استخدام خدماتنا.'),
            _buildBulletPoint(
                '2.11.	"الشّروط والأحكام": يُقصد بها هذه الشّروط وسياسة الخصوصيّة وكافة تعليمات وقواعد تشغيل التطبيق.'),
            _buildBulletPoint(
                '2.12.	"القوانين": يُقصد بها الأنظمة واللوائح والأوامر والمراسيم السارية في المملكة العربيّة السعوديّة.'),

            //======== الاقرارات و الضمانات

            _buildSectionTitle('[3] الإقرارات والضمانات'),
            _buildParagraph(
                'باستخدامك (الأسر المنتجة) لخدمات تطبيق "مأكول"، فأنت تقر وتضمن:'),
            _buildBulletPoint(
                '3.1. بأنّ لديك كامل الأهلية المعتبرة شرعًا ونظامًا لإبرام هذه الشّروط والأحكام.'),
            _buildBulletPoint(
                '3.2. بأنّ وصولك إلى تطبيق "مأكول" أو استخدام أيّ من خدماته أو النقر على الموافقة على الشّروط والأحكام، يعتبر إقرارًا منك على إبرام هذه الشّروط والأحكام إلكترونيًا مع مؤسسة نجلاء علي الدبيان وفقًا للأنظمة المعمول بها في المملكة العربيّة السعوديّة.'),
            _buildBulletPoint(
                '3.3. بأنّك لن تحاول الوصول إلى التطبيق بوسائل آلية، سواء من خلال روبوت أو برنامج نصي أو غير ذلك.'),
            _buildBulletPoint(
                '3.4. بأنّك ستستخدم تطبيق "مأكول" وفقًا لما هو مسموح به في هذه الشّروط وبما يتوافق مع القوانين السارية.'),
            _buildBulletPoint(
                '3.5. بأنّك لن تستخدِم التطبيق في أغراض غير قانونية أو غير مصرح بها أو غير مسموح بها، وأنّ استخدامك لخدمات التطبيق لن ينتهك أيّ قانون أو لائحة معمول بها.'),
            _buildBulletPoint(
                '3.6. بأنّك المسؤول عن جميع التصرفات التي تجريها من خلال حسابك، وتبعات هذا الاستخدام.'),

            _buildSectionTitle('[4] نطاق خدمات التطبيق'),

            _buildBulletPoint(
                '4.1.	يوفر تطبيق "مأكول" للأسر المنتجة الخدمات التالية:'),
            _buildSubPoint(
                '4.1.1. تسجيل حساب والاستفادة من المزايا التي يوفرها التطبيق بعد سداد رسوم الاشتراك.'),
            _buildSubPoint(
                '4.1.2. البنية التقنية لتوفير وتشغيل التطبيق بشكل آمن، ولوحة تحكم لإضافة المنتجات وإدارة الطلبات.'),
            _buildSubPoint('4.1.3. عرض المنتجات وتسويقها من خلال التطبيق.'),
            _buildSubPoint('4.1.4. الدعم الفني لجميع مستخدمي التطبيق.'),
            _buildBulletPoint(
                '4.2. يعد تطبيق "مأكول" وسيلة لعرض المحتوى والخدمات الخاصة به وعرض منتجات الأسر المنتجة.'),
            _buildBulletPoint(
                '4.3. لا يتحمّل تطبيق "مأكول" المسؤوليّة عن عمليات الشراء أو التعامل بين الأسر المنتجة والعُملاء.'),
            _buildBulletPoint(
                '4.4. يحق لنا -وفقًا لتقديرنا الخاص- تحديد المُحتوى، والمظهر، والتصميم، والأداء الوظيفي، وجميع الجوانب الأخرى المُتعلّقة بتطبيق "مأكول" وخدماته.'),

            _buildSectionTitle('[5] العقد الإلكتروني'),
            _buildBulletPoint(
                '5.1. تعد هذه الشّروط عقدًا إلكترونيًا صحيحًا مكتملاً الأركان القانونية بين مؤسسة نجلاء علي الدبيان وبينك (الأسرة المنتجة) فيما يتعلق باستخدام خدمات تطبيق "مأكول"، وتكون كافة الآثار القانونية الملزمة فيها سارية المفعول من تاريخ تسجيلك حساب، وتصبح ملزمًا بها كالتزامك بالعقود المبرمة كتابيًا، وينتج عنها نفس الآثار القانونية لمثل هذه العقود.'),
            _buildBulletPoint(
                '5.2. عند تعاقد الأسرة المنتجة مع أي عميل يشتري أي من الأكلات أو الوجبات التي تعرضها على تطبيق "مأكول"، فإن الأسرة المنتجة تدخل في علاقة مباشرة وملزمة قانونًا مع العميل، وتوافق الأسرة المنتجة على إخلاء مسؤولية التطبيق من التعاملات التي تتم بينها وبين أي عميل من خلالها، فالتطبيق ليس أسرة منتجة تعرض الأكلات أو الوجبات الصحية، ولا يتفاوض بشأنها أو أسعارها مع العميل، وإنّما يقتصر دوره على الوساطة والربط الطرفين لإتمام التعاقد من خلاله ويتحمّل كل طرف مسؤولية التعاقد مع الطرف الآخر.'),

            _buildSectionTitle('[6] حساب الأسر المنتجة'),
            _buildBulletPoint(
                '6.1.	من أجل استخدام خدمات تطبيق "مأكول"، يجب على الأسرة المنتجة تسجيل حساب ببيانات كاملة ودقيقة وصحيحة كما هو مطلوب في نموذج التسجيل. والموافقة على:'),
            _buildSubPoint(
                '6.1.1. تحرّي الدقة عند إدخال البيانات على تطبيق "مأكول"، وتحمُل مسؤوليّة مراجعتها بشكل دوريّ بغرض تصحيحُها أو تعديلُها أو تجديدُها كلما توفّرت لديك معلومات جديدة بشأنها.'),
            _buildSubPoint(
                '6.1.2. تزويد تطبيق "مأكول" بصورة سارية من رخصة أسرة منتجة أو وثيقة عمل حر.'),
            _buildSubPoint(
                '6.1.3. الحفاظ على أمان وسرية بيانات الدخول للحساب (اسم المُستخدِم وكلمة المرور) طوال الوقت، وتحمُل مسؤوليّة أي استخدام يقع من أي شخص قمت بالإفصاح له عن هذه البيانات.'),
            _buildSubPoint(
                '6.1.4. تقييد الغير من استخدام الحساب، وتحمُل المسؤوليّة عن الأنشطة التي تحدث من خلاله.'),
            _buildSubPoint(
                '6.1.5. إبلاغ إدارة "مأكول" على الفور بأي استخدام غير قانونيّ للحساب أو أي اشتباه في استخدامه، وذلك لاتخاذ الإجراءات التقنيّة اللازمة للمحافظة على الحساب.'),
            _buildSubPoint(
                '6.1.6. استخدام الحساب بما يتوافق مع القوانين واللوائح السارية في المملكة العربيّة السعوديّة، والامتثال بشروط وسياسات وقواعد وتعليمات تشغيل التطبيق.'),
            _buildSubPoint(
                '6.1.7. عدم الشروع بأي تصرف من شأنه إلحاق أي ضرر بشكل مباشر أو غير مباشر بنشاط التطبيق وأهدافه.'),
            _buildSubPoint(
                '6.1.8. عدم امتلاك أكثر من حساب واحد ما لم تسمح بذلك إدارة "مأكول".'),
            _buildBulletPoint(
                '6.2. يجب أن يكون المحتوى الذي تقدمه من حسابك لا يتضمن أي اعتداء على حقوق الآخرين.'),
            _buildBulletPoint(
                '6.3. يحقُ لنا تعليق أو إيقاف حساب الأسرة المنتجة بشكلٍ دائمٍ حسب شدّة المُخالفة في حالة عدم الالتزام ببنود هذه الشّروط أو القواعد وإرشادات الاستخدام المُتبعّة، أو أي استخدام غير مناسب لخدمات التطبيق.'),
            _buildBulletPoint(
                '6.4. يحقُ لنا إلغاء الحسابات التي لم يتم تأكيدها أو غير النشطة لفترة طويلة.'),
            _buildBulletPoint(
                '6.5. يحقُ لنا التحقق من بيانات ومتطلبات التسجيل والمعلومات التي تقدمها لنا الأسرة المنتجة، وبموجب هذه الشّروط تفوضنا الأسرة المنتجة بجمع واستخدام البيانات وفقًا لسياسة الخصوصيّة في التطبيق.'),

            _buildSectionTitle('[7] شروط الأسر المنتجة'),
            _buildBulletPoint(
                '7.1. تنطبق هذه الشروط على الأسر المنتجة المشتركة في تطبيق "مأكول".'),
            _buildBulletPoint(
                '7.2. يتم توفير المنتجات وفقاً للمواصفات والأسعار المعروضة حسب توفرها من قبل الأسر المنتجة دون تدخل من تطبيق "مأكول".'),
            _buildBulletPoint(
                '7.3. تلتزم الأسر المنتجة بالإعلان عن منتجاتها وتوضيح تفاصيلها وأسعارها بشكل صحيح وإضافة صور بجودة عالية وبطريقة جذابة ووضعها ضمن التصنيفات والتقسيمات المحددة في التطبيق.'),
            _buildBulletPoint(
                '7.4. تضمن الأسر المنتجة جودة الأكلات والوجبات التي تبيعها وأنها تم تحضيرها في بيئة مناسبة وصحية.'),
            _buildBulletPoint(
                '7.5. تضمن الأسر المنتجة أن الأكلات والوجبات تتوافق مع معايير الجودة والصحة والسلامة وفقاً للمقاييس الخاصة مثل معايير الاورجانيك، والماكروبيوتك، وأنها خالية من المواد المسببة للحساسية مثل الغلوتين واللاكتوز.'),
            _buildBulletPoint(
                '7.6. تلتزم الأسر المنتجة بتجهيز وتغليف الأكلات والوجبات بشكل جيد تفاديًا لتلفها أثناء التوصيل.'),
            _buildBulletPoint(
                '7.7. تلتزم الأسر المنتجة بوضع تاريخ الإنتاج وتاريخ الانتهاء على المنتجات.'),
            _buildBulletPoint(
                '7.8. يتم توصيل الطلبات من قبل الأسر المنتجة، وقد يوفر التطبيق في بعض الأحيان خدمة التوصيل.'),
            _buildBulletPoint(
                '7.9. تلتزم الأسر المنتجة بتسليم الأكلات والوجبات طازجة إلى العميل وبنفس المواصفات المحددة في الطلب.'),
            _buildBulletPoint(
                '7.10. تتحمّل الأسر المنتجة مسؤولية عدم صلاحية الأكلات والوجبات، أو أي أضرار تنتج عن تناولها، مثل التسمم الغذائي، والأمراض الناتجة عن تناول الطعام الملوّث أو الفاسد.'),
            _buildBulletPoint(
                '7.11. توافق الأسر المنتجة على تفويض تطبيق "مأكول" في تحصيل مبالغ الطلبات بالوسائل التي يوفرها، ويتم تسوية المبالغ المستحقة عن الطلبات نهاية كل شهر.'),
            _buildBulletPoint(
                '7.12. تتعهد الأسر المنتجة بالحفاظ على سرية وخصوصيّة بيانات العملاء، والتعهد بحمايتها.'),
            _buildBulletPoint(
                '7.13. تتحمّل الأسر المنتجة كافة المسؤوليات والالتزامات الناشئة عن إدارة الحساب وتنفيذ الطلبات، بما في ذلك الاسترجاع أو إلغاء الطلبات أو غير ذلك.'),
            _buildBulletPoint(
                '7.14. تتحمّل الأسر المنتجة مسؤولية الخسائر أو الأضرار أو التلفيات التي تحدث للمنتجات أثناء توصيلها.'),
            _buildBulletPoint(
                '7.15. تلتزم الأسر المنتجة بالتواصل مع العميل من خلال التطبيق، وعدم حث العملاء على الاتفاق والتعامل خارج نطاق التطبيق أو بدون علمه.'),
            _buildBulletPoint(
                '7.16. تتحمّل الأسر المنتجة مسؤولية الأكلات والوجبات التي يعرضها على تطبيق "مأكول"، سواء من حيث مُخالفتها لهذه الشّروط، أو بسبب عدم جودتها، أو عدم مطابقتها للمواصفات، أو بها عيوب في التحضير أو التجهيز، أو أيّ مطالبات تتعلق بها.'),
            _buildBulletPoint(
                '7.17. يحق لنا إيقاف حساب الأسر المنتجة -بشكل مؤقت أو دائم- واتخاذ الإجراءات المناسبة في حالة استخدم تطبيق "مأكول" بشكل يخالف السياسات المُتّبعة، أو القواعد والتعليمات الواردة في هذه الشّروط.'),

            _buildSectionTitle('[8] العمولة'),
            _buildBulletPoint(
                '8.1. يحصل تطبيق "مأكول" على عمولة ثابتة قدرها [10 %] على كل طلب مكتمل.'),
            _buildBulletPoint(
                '8.2. يحق لتطبيق "مأكول" تغيير أو تعديل العمولة، وسيتم إفادتك بذلك.'),

            _buildSectionTitle('[9] تراخيص الاستخدام'),
            _buildBulletPoint(
                '9.1.	مع مراعاة الالتزام والامتثال لهذه الشّروط، نمنحك بصفتك أسرة منتجة ترخيصًا شخصيًا محدودًا وغير حصري وغير قابل للتحويل وغير قابل للمُخالفة من أجل:'),
            _buildSubPoint(
                '9.1.1. تنزيل وتثبيت تطبيق "مأكول" على جوّالك للاستخدام الشخصي، وبما يتوافق مع هذه الشّروط.'),
            _buildSubPoint(
                '9.1.2. الوصول إلى التطبيق وخدماته والاطّلاع على محتواه والمعلومات والمواد ذات الصلة.'),
            _buildSubPoint(
                '9.1.3. استخدام التطبيق في إضافة وعرض الأكلات والوجبات الصحية ومتابعة الطلبات.'),
            _buildBulletPoint(
                '9.2. لا يشمل الترخيص الممنوح لك أي حقوق ملكية في تطبيق "مأكول" أو جزء منه، أو أي خدمة مقدمة من خلاله، كما لا يشير هذا الترخيص بشكلٍ مباشر أو غير مباشر لوجود شراكة من أي نوع بيننا وبينك.'),

            _buildSectionTitle('[10] ضوابط الاستخدام'),
            _buildBulletPoint(
                '10.1.	يحظر استخدام تطبيق "مأكول" بما يخالف هذه الشّروط. فلا يجوز القيام بأي مما يلي:'),
            _buildSubPoint(
                '10.1.1. استخدام أيّة وسيلة أو إجراء لاعتراض أو محاولة اعتراض التشغيل الصحيح للتطبيق، أو استخدام أيّ برنامج تم تصميمه لعرقلة، أو تلف، أو تدمير، أو تقييد وظيفة أيّ برنامج أو جهاز أو معدات اتصالات تتعلق أو ترتبط بالتطبيق.'),
            _buildSubPoint(
                '10.1.2. استخدام أيّ عمليات آلية لمعالجة، أو مراقبة، أو نسخ، أو استخراج أيّ صفحات موجودة على التطبيق.'),
            _buildSubPoint(
                '10.1.3. إجراء الهندسة العكسية، أو محاولة اكتشاف رمز المصدر، أو محاولة فك رموز، أو برمجة، أو تشفير أي من البرامج المستخدمة لتوفير التطبيق.'),
            _buildSubPoint(
                '10.1.4. منع أيّ مُستخدِم من استخدام التطبيق، أو انتحال شخصية أو صفة أيّ موظف أو ممثل للتطبيق.'),
            _buildSubPoint(
                '10.1.5. إرسال الرسائل غير المرغوب فيها أو البريد العشوائي أو الرسائل التي تدعم أنشطة غير قانونية.'),
            _buildSubPoint(
                '10.1.6. نشر أي محتوى غير قانوني يتضمن تمييزًا أو تشهيرًا أو إساءة أو قذف ضد أي فرد أو جهة أيًا كانت.'),
            _buildSubPoint(
                '10.1.7. نشر أي مادة تتنافى أو تتعارض مع حقوق الملكية الفكرية للآخرين.'),
            _buildSubPoint(
                '10.1.8. تحميل أو إدخال أو نقل أو بث أي مادة لا يحق لها نقلها بموجب أي قانون أو علاقة تعاقدية.'),
            _buildSubPoint(
                '10.1.9. العبث بالبيانات والمعلومات أو محاولة تعديل أو إتلاف أي إجراءات أمنية أو توثيقية.'),
            _buildSubPoint(
                '10.1.10. التدخل في طبيعة عمل التطبيق عن طريق نشر الفيروسات، أو البرامج الإعلانية، أو برامج التجسس، أو أي تقنيات أخرى مثل برامج الإلغاء الآلية، أو التعليمات البرمجية الضارة، أو الأساليب، أو التقنيات المماثلة التي قد تعطل أو تتدخل في تشغيله أو توفيره.'),
            _buildSubPoint(
                '10.1.11. محاولة استكشاف، أو فحص، أو اختبار نقاط الضعف في أيّ من الخوادم المتصلة بالتطبيق.'),
            _buildSubPoint(
                '10.1.12. انتهاك قوانين التأليف والنشر، أو العلامة التجارية، أو براءة الاختراع، أو قواعد البيانات، أو الإعلانات، أو أي من حقوق الملكية الفكرية التي تتعلق بنا أو بالغير.'),
            _buildBulletPoint(
                '10.2. يحق لتطبيق "مأكول" إنهاء استخدامك وإنهاء التراخيص الممنوحة لك في حالة عدم التزامك بهذا البند.'),

            _buildSectionTitle('[11] إخلاء المسؤولية القانونية'),
            _buildBulletPoint(
                '11.1. يتم توفير تطبيق "مأكول" وخدماتها على أساس "كما هو متوفر" أو "كما هو متاح" دون أيّ ضمانات أو تعهدات من أيّ نوع، سواء كانت صريحة أو ضمنية فيما يتعلق بموثوقية الخدمات أو توقيتها أو جودتها أو ملاءمتها أو توافرها، أو خلوها من الأخطاء.'),
            _buildBulletPoint(
                '11.2. توافق الأسر المنتجة على إخلاء مسؤولية تطبيق "مأكول" من الخسائر أو الأضرار سواء المباشرة أو غير المباشرة، أو التبعية، أو العرضية التي تنشأ عن:'),
            _buildSubPoint(
                '11.2.1. صحة أو دقة المعلومات التي تعرضها الأسر المنتجة عن الأكلات والوجبات.'),
            _buildSubPoint(
                '11.2.2. التعاملات التي تتم بين الأسر المنتجة وبين أي عميل خارج تطبيق "مأكول".'),
            _buildSubPoint(
                '11.2.3. الخلافات التي تحدث بين الأسر المنتجة وبين العميل فيما يتعلق بأي طلب.'),
            _buildSubPoint(
                '11.2.4. الأمراض الناتجة عن تناول الطعام الملوّث أو الفاسد.'),
            _buildSubPoint(
                '11.2.5. تأخر توصيل الطلب إلى العميل أو عدم استلامه من العميل.'),
            _buildSubPoint(
                '11.2.6. تعرض الأكلات أو الوجبات للتلوث أو التلف أثناء توصيله إلى العميل.'),
            _buildBulletPoint(
                '11.3. لن نتحمّل المسؤوليّة بأي حال من الأحوال في حالات:'),
            _buildSubPoint(
                '11.3.1. العُطل، أو الانقطاع، أو التوقُف، أو الاضطراب، أو عدم التوافر (المؤقت و/أو الجزئي) للتطبيق.'),
            _buildSubPoint(
                '11.3.2. التقصير أو التأخر في الأداء متى كان ذلك ناتجًا عن القوة القاهرة، أو الظروف الطارئة التي تخرج عن نطاق السيطرة وكان من شأنها منع أو تأخير تقديم خدمات تطبيق "مأكول".'),
            _buildSubPoint(
                '11.3.3. الروابط الخارجية المُرتبطة بالتطبيق، ولا تُعَد هذه الروابط مُصادَقَةً منا عليها.'),
            _buildSubPoint(
                '11.3.4. الخدمات والميزات التي يقدمها الآخرين حتى لو تم الوصول إليها عن طريق تطبيق "مأكول".'),
            _buildSubPoint(
                '11.3.5. التقصير في الحفاظ على أمان وسرية وخصوصيّة بيانات الحساب.'),
            _buildBulletPoint(
                '11.4. لن يكون تطبيق "مأكول" مسئولاً عن أية التزام قانوني، أو مالي، أو مادي تجاه الأسر المنتجة أو العملاء نتيجة عدم توفّر أو عدم صلاحية المنتجات المعروضة على التطبيق أو سداد قيمتها.'),
            _buildBulletPoint(
                '11.5. لن نتحمّل المسؤولية عن أيّ خسارة أو ضرر ناتج عن أيّ فيروسات أو أيّ مواد أخرى ضارة قد تؤثر على أو تصيب جوالك، أو حاسوبك، أو الجهاز اللوحي، أو أي معدات أو برامج أو غيرها بسبب استخدامك لخدماتنا؛ أو تنزيلك للمحتوى، أو أيّ معلومات أو مواد من أي موقع أو منصّة أخرى مُرتبطة بتطبيق "مأكول".'),
            _buildBulletPoint(
                '11.6. نسعى لبذل قصارى جهدنا لضمان توافر تطبيق "مأكول" وخدماته للاستخدام على مدار الساعة، ولكن قد نقوم من وقت لآخر بإجراء تحديثات عليها بسبب أعمال التطوير، أو الصيانة الدوريّة، أو إصلاح المشكلات الفنيّة، أو ما شابه.'),
            _buildBulletPoint(
                '11.7. تقر وتوافق الأسر المنتجة بأن تطبيق "مأكول" عبارة عن خدمة إلكترونية عبر الإنترنت للربط بين الأسر المنتجة والعملاء، فالتطبيق لا يمثل أي منهما ولا يعتبر وكيلاً عنهما.'),
            _buildBulletPoint(
                '11.8. تعلم وتوافق الأسر المنتجة بأن شبكة الإنترنت دائمًا ما تكون عرضة لفساد البيانات أو عدم توفرها أو تأخر ظهورها، وبالتالي لا نضمن أنّ الأعطال التقنيّة سيتم إصلاحُها، أو أن التطبيق أو خوادمه سيكون خاليًا من الفيروسات أو المكونات الضارة، كما يوافق على إعفائِنا من أيّ مسؤوليّة قانونيّة في حالة التوقف نتيجة ذلك.'),

            _buildSectionTitle(
                '[12] حقوق الملكيّة الفكريّة والعلامات التجاريّة'),
            _buildBulletPoint(
                '12.1. تحتفظ مؤسسة نجلاء علي الدبيان بجميع حقوق الملكيّة الفكريّة في تطبيق "مأكول" وكافة الحقوق المتعلقة به بما في ذلك على سبيل المثال لا الحصر حقوق التأليف والنشر، وبراءات الاختراع، وقاعدة البيانات، والمظهر التجاري، والأسماء والعلامات التجاريّة، وعلامات الخدمة، والشعارات، والكلمات، ورؤوس الصفحات، والحملات الإعلانية، والتصاميم، والشعارات، والأيقونات، والأعمال الفنية، والرسومات، والصور، والفيديو، ومواد الجرافيك، والنصوص، والخطوط، والبرامج، وملفات الصوت، والمواد الرقمية، والوثائق، والبيانات، والأشكال المُستخدَمة في توفير التطبيق، وهي محمية بموجب قوانين الملكيّة الفكريّة.'),
            _buildBulletPoint(
                '12.2. تحتفظ مؤسسة نجلاء علي الدبيان بجميع الحقوق في العلامات التجاريّة لتطبيق "مأكول"، سواء كانت مسجّلة أو غير مسجّلة، ولا يجوز إعادة إنتاجها أو استخدامها في أيّ وسيلة إعلانيّة دون إذن كتابي منا.'),
            _buildBulletPoint(
                '12.3. تحتفظ مؤسسة نجلاء علي الدبيان بجميع الحقوق في تطبيق "مأكول" وجميع الأجهزة والبرامج والعناصر الأخرى المُستخدَمة لتوفيره، ويعدُ أي تقليد أو اقتباس لكل أو بعض ميزاته انتهاكًا لحقوق الملكيّة الفكريّة والتأليف والنشر، وسيتم اتخاذ كافة الإجراءات القانونية ضد مرتكب الانتهاكات المذكورة.'),

            _buildSectionTitle('[13] انتهاك الحقوق'),
            _buildBulletPoint(
                '13.1. يُمنع منعًا باتًا بأي شكلٍ من الأشكال بيع أو ترخيص أو تأجير أو تعديل أو نسخ أو استنساخ أو إعادة طبع أو تحميل أو إعلان أو نقل أو توزيع أو العرض بصورة علنيّة أو تحرير أو إنشاء أعمال مشتقة من أيّ مواد أو محتويات تطبيق "مأكول" دون إذن كتابي منا.'),
            _buildBulletPoint(
                '13.2. يُمنع منعًا باتًا انتهاك حقوق الملكيّة الفكريّة لتطبيق "مأكول" أو العلامات التجاريّة أو التصاميم أو محتوى التطبيق، أو محاولة التعديل عليها أو استخدامها في أي أغراض غير قانونيّة.'),

            _buildSectionTitle('[14] التعويض'),
            _buildParagraph(
                'توافق الأسر المنتجة على تعويض مؤسسة نجلاء علي الدبيان والدفاع عنها وإبراء ذمتها ومسئوليتها بما في ذلك المسؤولين والمديرين والموظفين من أو ضد كافة الدعاوى، أو المطالبات، أو الغرامات، أو التكاليف، أو النفقات بما في ذلك الرسوم القانونيّة وأتعاب المحاماة التي تنشأ عن أو تتعلق بـ:'),
            _buildBulletPoint(
                '14.1. الادعاءات أو المطالبات الناتجة عن استخدامه لتطبيق "مأكول".'),
            _buildBulletPoint(
                '14.2. أي إهمال أو سوء سلوك من جانبه، أو سوء استخدامه لخدمات التطبيق بأي شكلٍ كان.'),
            _buildBulletPoint(
                '14.3. التصرف أو اتخاذ أي إجراء من شأنه الإضرار بالتطبيق أو سمعته أو توجهاته سواء بشكلٍ مباشر أو غير مباشر.'),
            _buildBulletPoint(
                '14.4. انتهاك أيًا من هذه الشّروط، أو قواعد وتعليمات تتعلق بتشغيل تطبيق "مأكول".'),
            _buildBulletPoint(
                '14.5. انتهاك حقوق الملكيّة الفكريّة وحقوق النشر والعلامات التجاريّة والخصوصيّة أو أي من القوانين السّارية.'),

            _buildSectionTitle('[15] الاتصالات الإلكترونية'),
            _buildBulletPoint(
                '15.1. يحق لنا التواصل معك من خلال البريد الإلكتروني المسجّل لدينا لتزويدك بالإعلانات أو فيما يتعلق بأي تحديثات حول هذه الشّروط أو سياسة الخصوصيّة، الخصوصيّة، أو النشرات الإخبارية، أو الإشعارات الفنية، أو تنبيهات الأمان، أو الرسائل الإدارية من تطبيق "مأكول"، أو لأغراض تسويقيّة، أو لإعلامك بأي ميزات أو أنشطة جديدة أو خدمات تضاف إلى التطبيق، أو وفقاً لما يقتضيه القانون، أو لأغراض أخرى وفقًا لتقديرنا الخاص، وإذا قررت في أيّ وقت عدم استلام مثل هذه الاتصالات الإلكترونية، فيمكنك تعطيل استلام هذه الرسائل عن طريق مراسلتنا عبر البريد الإلكتروني أو عن طريق النقر على رابط إلغاء الاشتراك الموجود أسفل الرسالة الإلكترونية، ولكن في هذه الحالة لا نضمن تمتعك بخدماتنا بشكل كامل.'),
            _buildBulletPoint(
                '15.2. أنت توافق على أن كل الاتصالات الإلكترونية تفي بجميع المتطلبات القانونية كما لو كانت هذه الاتصالات مكتوبة.'),

            _buildSectionTitle('[16] الرسائل و الإشعارات'),

            _buildBulletPoint(
                '16.1. أي إشعارات أو رسائل ترغب الأسر المنتجة في إرسالها إلى تطبيق "مأكول"، يجب أن تكون من خلال الوسائل المحددة في التطبيق، ولا يعتد بأي رسائل أو إشعارات أخرى غير ما هو محدد.'),
            _buildBulletPoint(
                '16.2. أي إشعارات أو رسائل نرسلها إلى العميل، تكون إما عن طريق التطبيق أو عن طريق إرسالها على البريد الإلكتروني المسجّل في حساب الأسرة المنتجة.'),

            _buildSectionTitle('[17] السرية وحماية البيانات'),

            _buildBulletPoint(
                '17.1. يستخدم تطبيق "مأكول" البيانات الشخصيّة بالطريقة الموضحة في سياسة الخصوصيّة والتي تعتبر جزءًا لا يتجزأ من الشّروط والأحكام، وعلى النحو المبين بمزيد من التفصيل في تلك السياسة.'),
            _buildBulletPoint(
                '17.2. عند استخدام تطبيق "مأكول"، فأنت تُقر وتوافق على جمع واستخدام بياناتك الشخصيّة بالطريقة المبينة في سياسة الخصوصيّة أو التعديلات التي تطرأ عليها بما يتناسب مع القوانين السّارية.'),

            _buildSectionTitle('[18] المدة والإنهاء'),

            _buildBulletPoint(
                '18.1. تدخل هذه الشروط حيز التنفيذ من تاريخ تسجيل حساب والإقرار بقبولك لها وستظل سارية المفعول حتى يتم إنهاؤها من قبلك أو من قبلنا.'),
            _buildBulletPoint(
                '18.2. يجوز لنا وفقًا لتقديرنا المطلق إنهاء أو تقييد أو إيقاف حقك في الوصول إلى تطبيق "مأكول" واستخدام خدماته في أيّ وقت دون إشعار، في حال انتهكت أيًا من هذه الشّروط أو سياسة الخصوصيّة، أو أنّك أسأت استخدامه بأي شكل، أو ارتكبت أي سلوك آخر قد نعتبره حسب تقديرنا الخاص غير قانوني أو بالآخرين.'),
            _buildBulletPoint(
                '18.3. يجوز لك إنهاء هذه الشّروط في أيّ وقت عن طريق التوقف عن استخدام خدمات تطبيق "مأكول" وإلغاء الحساب -في حال توفر ذلك؛ وفي حالة الإنهاء ستتوقف كافة التراخيص الممنوحة لك بموجب هذه الشّروط، ولن يكون مصرحًا لك بالوصول إلى التطبيق.'),

            _buildSectionTitle('[19] تعديلات الشّروط'),

            _buildBulletPoint(
                '19.1. يحق لنا مراجعة وتعديل بنود هذه الشّروط من وقت لآخر لملاءمة القوانين السارية أو متى رأت المصلحة ذلك، وستسري النسخة المعدّلة فور نشرها على هذه الصفحة وتحديث تاريخ السريان.'),
            _buildBulletPoint(
                '19.2. يحق لنا إجراء أية تعديلات نراها ضرورية على تطبيق "مأكول" لزيادة فاعليته، ويجب الالتزام بأية توجيهات أو تعليمات تقدّم إليك في هذا الشأن.'),
            _buildBulletPoint(
                '19.3. أنت توافق على مراجعة هذه الشّروط لمعرفة التعديلات التي تتم عليها، ويعني استمرارك في استخدام تطبيق "مأكول" بعد تحديث هذه الشّروط موافقة صريحة على هذه التعديلات وقبولاً قانونيًا بالنسخة الأحدث منها، وأنّ النسخة الحالية حلت محل جميع النسخ السابقة.'),

            _buildSectionTitle('[20] القوانين والاختصاص القضائي'),

            _buildBulletPoint(
                '20.1. تخضع وتفسر هذه الشّروط وفقًا للقوانين المعمول بها في المملكة العربيّة السعوديّة.'),
            _buildBulletPoint(
                '20.2. يختص القضاء السعودي بالفصل في أي نزاع قد ينشأ عن تفسير أو تنفيذ أحكام هذه الشروط.'),
            _buildBulletPoint(
                '20.3. في حال أصبح أي حكم من أحكام هذه الشّروط غير ساري أو غير قانوني أو غير قابل للتنفيذ، فان قانونية وقابلية تنفيذ الأحكام الأخرى لن تتأثر بأي طريقة كانت بذلك الحكم.'),

            _buildSectionTitle('[21] أحكام أخرى'),

            _buildBulletPoint(
                '21.1. يحق لنا تحويل كافة حقوقنا الواردة في هذه الشّروط إلى أي طرف ثالث دون أيّ اعتراض منك بشرط أن يوافق هذا الطرف الثالث على الالتزام بهذه الشّروط.'),
            _buildBulletPoint(
                '21.2. لا يُفسر استخدامك لتطبيق "مأكول" على أنه يشكل علاقة شراكة، أو توظيف، أو وكالة، أو مشروع مشترك بين مؤسسة نجلاء علي الدبيان وبينك.'),
            _buildBulletPoint(
                '21.3. كتبت هذه الشّروط باللغةِ العربيّة، وفي حال ترجمتُها إلى لغةٍ أجنبيّةٍ أخرى، فإن النص العربيّ سيكون هو المعتمد.'),
            _buildBulletPoint(
                '21.4. في حال تعارضت هذه الشّروط مع أيّ من إصدارات سابقة لها، فإنّ النُسخة الحالية تكون هي السائدة والمعتمدة.'),
            _buildBulletPoint(
                '21.5. تشكل هذه الشّروط وسياسة الخصوصيّة (وتحديثاتها من حين لآخر) الاتفاق الكامل بينك (الأسر المنتجة) وبين مؤسسة نجلاء علي الدبيان فيما يتعلق باستخدام تطبيق "مأكول" وخدماته، وتحل محل أي إصدارات سابقة من هذه الشّروط.'),
            _buildBulletPoint(
                '21.6. تقر وتتعهّد الأسر المنتجة بقراءة هذه الشّروط وتوافق على الالتزام بجميع أحكامها.'),
            _buildSectionTitle('[22] معلومات التواصل'),
            _buildParagraph(
                'إذا كانت لديك أيّ أسئلة أو استفسارات حول هذه الشروط، فلا تتردد في التواصل معنا على البريد الإلكتروني _________ أو رقم الهاتف ___________.'),
            _buildParagraph(' جميع الحقوق محفوظة لتطبيق "مأكول" © 2024.'),
          ],
        ),
      ),
    );
  }

  Widget _buildSectionTitle(String title) {
    return Container(
      padding: const EdgeInsets.all(8.0),
      margin: const EdgeInsets.only(top: 12),
      decoration: const BoxDecoration(
        color: Color(0xFFd9d9d9),
      ),
      child: Text(
        title,
        style: const TextStyle(fontSize: 18, fontWeight: FontWeight.bold),
      ),
    );
  }

  Widget _buildParagraph(String text) {
    return Padding(
      padding: const EdgeInsets.symmetric(vertical: 4.0),
      child: Text(
        text,
        // textAlign: TextAlign.center,
        style: const TextStyle(fontSize: 16),
      ),
    );
  }

  Widget _buildBulletPoint(String text) {
    return Padding(
      padding: const EdgeInsets.symmetric(vertical: 2.0, horizontal: 8.0),
      child: Row(
        crossAxisAlignment: CrossAxisAlignment.start,
        children: [
          const Text("• ", style: TextStyle(fontSize: 16)),
          Expanded(
            child: Text(
              text,
              textAlign: TextAlign.justify,
              style: const TextStyle(fontSize: 16),
            ),
          ),
        ],
      ),
    );
  }

  Widget _buildSubPoint(String text) {
    return Padding(
      padding: const EdgeInsets.symmetric(vertical: 2.0, horizontal: 8.0),
      child: Row(
        crossAxisAlignment: CrossAxisAlignment.start,
        children: [
          const Text("   -  ", style: TextStyle(fontSize: 14)),
          Expanded(
            child: Text(
              text,
              textAlign: TextAlign.justify,
              style: const TextStyle(fontSize: 16),
            ),
          ),
        ],
      ),
    );
  }
}
